
//Дана сторона квадрата a. Найти его площадь S = a2.
#include <iostream>
using namespace std;
int main()
{
    int a, S;
    cout << "enter a";
    cin >> a;
    S = a * a;
    cout << S;

}

