//Дана сторона квадрата a. Найти его площадь S = a2.
#include <iostream>
using namespace std;
int main()
{
    int a;
    cout << "enter a";
    cin >> a;
    cout << a * a;
}

